{
   "joke_list": [
    "Astronaut 1: Hey mate, I can't find any milk for my coffee \n Astronaut 2: In space, no one can. Here, use cream",
    "A ghost floats into a bar and asks for a double gin & tonic. Bartender says \"Sorry we don't serve spirits\"",
    "How do you turn a duck into a soul singer?\nPut it inthe oven and wait 'till it's Bill Withers",
    "Man walks into a bar, puts down a slab of concrete and says, \"Can I have a beer, and one for the road too\"",
    "What do you call birds that are stuck together?\n \"Vel-Crows\"",
    "Descartes walks into a bar and orders a drink.\n When he finishes, the bartender asks if he wants another.\n Descartes replies, \"No, I think not!\" and - *poof!* he disappears.",
    "What do you call and Italian with a rubber toe?\n Roberto!",
    "Q: How did the Caret escape prison?\n A: It's an escape character.",
    "If a witch needs to modify one her existing spells, does she use a hex editor?",
    "I went to the zoo and saw a baguette in a cage.\n The zookeeper said it was bread in captivity.",
    "Q: Why do chicken coops have two doors?\n A: Because if they had four it would be a chicken sedan.",
    "Q: What do you call a priest that graduated law school?\n A: Father in law.",
    "Q: Why haven't aliens visited Earth?\n A: They've read the reviews. We have only one star.",
    "Scientists got bored watching the earth turn, so after 24 hours they called it a day.",
    "A programmer was arressted for writing unreadable code. He refused to comment.",
    "Q: What does the 'S' in IoT stand for?\n A: Security.",
    "What is the difference between illegal and unlawful?\n A: One of them is against the law and the other is a sick bird.",
    "Q: How do you make a water bed more bouncy?\n A: Add spring water.",
    "A termite walks into a bar and asks \"Is your bar tender here?\"",
    "Q: What's the best part about living in Switzerland?\n A: I don't know, but the flag is a big plus.",
    "My dad cried when he opened his 60th birthday card and said \"One would have been enough\"",
    "Q: What's the difference between in-laws and outlaws?\n A: Outlaws are wanted.",
    "Q: Did you hear about the scarecrow that won an award?\n A: He was just outstanding in his field.",
    "To the man who stole my install disk for Microsoft Office - I will find you, you have my Word!",
    "A man walks into a zoo. The only animal there is a dog. It's a Shih Tzu.",
    "Got pulled over by the cops the other day. They asked me if I had a police record. I said no but I got plenty of sting records.",
    "My dad always used to say \"When one door closes, another one opens.\" Great man, terrible cabinet maker",
    "Q: What do you call a deer without an eye?\n A: No-eye-deer.",
    "A three legged dog walks into a saloon, and says \"I'm lookin' for the man who show my paw.\"",
    "I don't trust stairs. They are always up to something.",
    "Q: What do you say to a nosy pepper?\n A: Japaeno business!",
    "Q: What's the difference between roast beef and pea soup?\n A: Anyone can roast beef."
   ],
   "joke_object": [
      { 
         "id": 1000,
         "type": "Two Line",
         "joke": "Astronaut 1: Hey mate, I can't find any milk for my coffee \n Astronaut 2: In space, no one can. Here, use cream",
         "rating": "*****"
      },
      { 
         "id": 1001,
         "type": "Two Line",
         "joke": "A ghost floats into a bar and asks for a double gin & tonic. Bartender says \"Sorry we don't serve spirits\"",
         "rating": "*****"
      },
      {
         "id": 1002,
         "type": "Two Line",
         "joke": "How do you turn a duck into a soul singer?\nPut it inthe oven and wait 'till it's Bill Withers",
         "rating": "*****"
      },
      {
         "id": 1003,
         "type":"One Line",
         "joke": "Man walks into a bar, puts down a slab of concrete and says, \"Can I have a beer, and one for the road too\"",
         "rating": "*****"
      },
      {
         "id": 1004,
         "type": "Two Line",
         "joke": "What do you call birds that are stuck together?\n \"Vel-Crows\"",
         "rating": "*****"
      },
      {
         "id": 1005,
         "type": "Multi-Line",
         "joke": "Descartes walks into a bar and orders a drink.\n When he finishes, the bartender asks if he wants another.\n Descartes replies, \"No, I think not!\" and - *poof!* he disappears.",
         "rating": "*****"
      },
      {
         "id": 1006,
         "type":"Two Line",
         "joke": "What do you call and Italian with a rubber toe?\n Roberto!",
         "rating": "*****"
      },
      {
         "id": 1007,
         "type": "One Line",
         "joke": "Is it just me, or does anyone else find magnets extremely attractive?",
         "rating": "*****"
      }
   ]
}
